Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/personal_insolvency_options.html.txt.tmx
Source language: en
Languages: ga

source: • Mechanisms introduced by the Personal Insolvency Act
ga: • Meicníochtaí faoin Acht um Dhócmhainneacht Phearsanta

source: • Insolvency Service of Ireland
ga: • Seirbhís Dócmhainneachta na hÉireann

source: In the past, if you were insolvent – that is, you were unable to pay your debts or meet your liabilities – bankruptcy was the only formal mechanism available for you to settle your debts and get protection from your creditors
ga: Roimhe seo, má bhí tú dócmhainneach – is é sin, mura raibh tú in ann do chuid fiachais a íoc nó do chuid dliteanas a chomhlíonadh – ba í féimheacht an t-aon mheicníocht fhoirmiúil a bhí ar fáil duit chun do chuid fiachais a réiteach agus cosaint a fháil ó do chreidiúnaithe

source: Three new debt resolution mechanisms were introduced under the Personal Insolvency Act 2012 for people who cannot afford to pay their personal and mortgage debts
ga: Tugadh 3 mheicníocht nua réitigh fiachais isteach in 2013 faoin Acht um Dhócmhainneacht Phearsanta 2012 do dhaoine nach féidir leo íoc as a bhfiachas pearsanta agus morgáiste

source: The Insolvency Service of Ireland (ISI) administers these debt resolution processes
ga: Déanann Seirbhís Dócmhainneachta na hÉireann maoirsiú ar na próisis réitigh fiachais

source: The rules on bankruptcy have also changed and the Official Assignee in Bankruptcy is now based within the ISI
ga: Athraíodh na rialacha maidir le féimheacht freisin, le héifeacht ón 3 Nollaig 2013 agus tá an Sannaí Oifigiúil i bhFéimheacht ag oibriú anois laistigh den tSeirbhís Dócmhainneachta

source: Read more in our document on bankruptcy
ga: Léigh tuilleadh inár gcáipéis maidir le féimheacht

source: Statistics on the operation of all the above processes are published on the ISI’s main website isi.gov.ie
ga: Foilsíonn an tSeirbhís Dócmhainneachta staitisticí mar gheall ar oibriú na bpróiseas nua, chomh maith le sonraí ar chostais atá le n-íoc

source: Measures to support people in mortgage arrears
ga: An tAcht um Dhócmhainneacht Phearsanta 2012

source: The Personal Insolvency Act 2012 became law in December 2012
ga: Síníodh an tAcht um Dhócmhainneacht Phearsanta 2012 sa dlí i Nollaig 2012

source: The Act was amended by Part 7 of the Courts and Civil Law (Miscellaneous Provisions) Act 2013
ga: Leasaíodh an tAcht le Cuid 7 den Acht um Chúirteanna agus an Dlí Sibhialta (Forálacha Ilghnéitheacha) 2013 (pdf)

source: A series of Statutory Instruments was made in order to bring the various sections into effect and implement the personal insolvency system
ga: Rinneadh sraith Ionstraimí Reachtúla chun na míreanna éagsúla a thabhairt isteach chun feidhme mar aon leis an gcóras nua um dhócmhainneacht phearsanta a chur i bhfeidhm

source: Further amendments were made by the Companies (Miscellaneous Provisions) Act 2013 and the Personal Insolvency (Amendment) Act 2015
ga: Rinneadh tuilleadh leasuithe le Acht na gCuideachtaí (Forálacha Ilghnéitheacha) 2013

source: The Law Reform Commission has prepared a consolidation of the Personal Insolvency Act (pdf)
ga: Tá leagan comhdhlúthaithe den Acht (pdf) foilsithe ag an gCoimisiún um Athchóiriú an Dlí

source: The Act introduced 3 new debt resolution mechanisms to help mortgage-holders and other people with unsustainable debt to reach agreements with their creditors
ga: Thug an tAcht isteach 3 mheicníocht nua réitigh fiachais chun cabhrú le sealbhóirí morgáiste, agus le daoine eile ag a bhfuil fiachas neamhinmharthana, comhaontuithe a bhaint amach lena gcreidiúnaithe

source: These mechanisms offer different solutions to people in different situations
ga: Cuireann na meicníochtaí seo réitigh dhifriúla ar fáil do dhaoine i gcásanna éagsúla

source: One important issue is whether your debts are secured or not
ga: Is ceist thábhachtach amháin cibé acu an bhfuil d’fhiachas faoi urrús nó nach bhfuil

source: A secured debt is a loan on which property or goods are available as security against non-payment
ga: Iasacht atá i bhfiachas faoi urrús ar a bhfuil fáil ar réadmhaoin nó earraí mar urrús i leith neamhíocaíochta

source: Mortgages are the most common secured loans
ga: Is iad morgáistí na hiasachtaí is coitianta d’iasachtaí faoi urrús

source: In general, debts such as bank loans and credit card debt are unsecured, but if they are rolled up into your mortgage, they become secured loans
ga: Go ginearálta, bíonn fiachas ar nós iasachtaí bainc agus fiachas cárta creidmheasa gan urrús, ach má chuirtear iad in éineacht le do mhorgáiste, áfach, déantar iasachtaí faoi urrús díobh

source: The mechanisms introduced by the Personal Insolvency Act are:
ga: Is iad na meicníochtaí nua ná:

source: • A Debt Relief Notice (DRN) to allow for the write-off of debt (generally unsecured and in some cases secured) up to a certain limit, subject to a 3-year supervision period. This upper limit was originally €20,000 but was increased to €35,000 with effect from 29 September 2015
ga: • Fógra um Fhaoiseamh Fiachais (DRN) a cheadóidh díscríobh fiachais (fiachas gan urrús a bhíonn i gceist go ginearálta agus i gcásanna áirithe is fiachas faoi urrús a bhíonn i gceist), a mhéid le €20,000 a cheadú, faoi réir tréimhse mhaoirseachta 3 bliana

source: • A Debt Settlement Arrangement (DSA) for the agreed settlement of unsecured debt, with no limit involved, normally over 5 years
ga: • Socrú Réitigh Fiachais (DSA) do réiteach comhaontaithe fiachais gan urrús, gan teorainn ar bith i gceist, agus is gnách go mbíonn seo thar thréimhse 5 bliana

source: • A Personal Insolvency Arrangement (PIA) for the agreed settlement of secured debt up to €3 million (though this cap can be increased) and unsecured debt, with no limit involved, normally over 6 years
ga: • Socrú um Dhócmhainneacht Phearsanta (PIA) le haghaidh réiteach comhaontaithe fiachais faoi urrús a mhéid le €3 milliún (ach is féidir an uasteorainn seo a mhéadú) agus fiachais gan urrús, gan teorainn ar bith i gceist, thar 6 bliana

source: These mechanisms are described in more detail below
ga: Déantar cur síos níos sonraí ar na meicníochtaí seo thíos

source: The Act also introduced automatic discharge from bankruptcy, subject to certain conditions, after 3 years as opposed to 12 years previously. This period was later reduced to 1 year
ga: Ina theannta sin, thug an tAcht díscaoileadh uathoibríoch ó fhéimheacht isteach, faoi réir coinníollacha áirithe, i ndiaidh 3 bliana, seachas 12 bhliain roimh 3 Nollaig 2013

source: Mechanisms introduced by the Personal Insolvency Act
ga: Meicníochtaí faoin Acht um Dhócmhainneacht Phearsanta

source: Each of these debt resolution mechanisms has its own rules and procedures but the following main rules apply to all of them:
ga: Tá a rialacha agus a nósanna imeachta féin ag gach ceann de na meicníochtaí réitigh fiachais, ach tá na príomhrialacha a leanas i gceist le gach ceann díobh:

source: You can be involved in only one of the 3 mechanisms (DRN, DSA or PIA) or in the bankruptcy process at any one time
ga: Ní fhéadfaidh tú bheith bainteach ach i gceann amháin de na meicníochtaí nua (DRN, DSA nó PIA) nó sa phróiseas féimheachta ag aon tráth amháin

source: If you use one of these 4 processes, you will generally have to wait some years before applying to use another
ga: Má úsáideann tú ceann amháin de na 4 phróiseas seo, is gnách go mbeidh ort fanacht roinnt blianta sula ndéanfaidh tú iarratas ar cheann eile

source: You may use each of the 3 mechanisms only once in your lifetime
ga: Féadfaidh tú gach ceann de na meicníochtaí nua a úsáid ach uair amháin i do shaol

source: (There is no such limit on bankruptcy but it would be rare for anyone to go bankrupt twice.)
ga: (Níl an teorainn chéanna i gceist ar fhéimheacht ach is annamh a tharlódh go mbeadh duine thíos le féimheacht faoi dhó.)

source: You must not deliberately stop paying (or underpay) your creditors while these procedures are being set up as this may cause your application to be ineligible
ga: Níor cheart duit stopadh ag íoc (nó gan dóthain a íoc) d’aon turas le do chuid creidiúnaithe fad atá na nósanna imeachta seo á mbunú, mar gheall go bhféadfadh go ndéanfaí iarratas neamh-incháilithe de d'iarratas dá dheasca

source: You will have to complete a Prescribed Financial Statement, giving full and honest information about your financial circumstances
ga: Beidh ort Ráiteas Forordaithe Airgeadais a chomhlíonadh, ina dtugtar faisnéis iomlán agus ionraic faoi do chuid cúinsí airgeadais

source: You will have to sign a Statutory Declaration to this effect
ga: Beidh ort Dearbhú Reachtúil a shíniú ina leith seo

source: You must act in good faith and co-operate fully with the process
ga: Ní mór duit gníomhú le hintinn mhaith agus comhoibriú go hiomlán leis an bpróiseas

source: You will have to give your written consent to the accessing of certain personal data held by banks and other financial institutions so that your financial situation can be verified
ga: Beidh ort do thoiliú i scríbhinn a thabhairt go bhfaighfear rochtain ar roinnt sonraí pearsanta atá á gcoinneáil ag bainc agus ag institiúidí airgeadais eile ionas gur féidir do staid airgeadais a fhíorú

source: Government departments and agencies will have the power to release certain information about you
ga: Beidh sé de chumhacht ag ranna agus gníomhaireachtaí an Rialtais faisnéis áirithe fút a scaoileadh

source: If you use any of these 3 mechanisms, your name and details will be published on a register, which is accessible to the public
ga: Má úsáideann tú aon cheann de na meicníochtaí seo, foilseofar d’ainm agus do shonraí ar chlár a bhfuil rochtain ag an bpobal air

source: The success or failure of the process will also be recorded
ga: Ina theannta sin, cuirfear i dtaifead rath nó teip an phróisis

source: Regulation (EU) No.663/2014 (pdf) updated the Annexes to the Regulation on Insolvency Proceedings (EC) No 1346/2000 (pdf), which aims to simplify formalities governing the reciprocal recognition and enforcement of judgments in cross-border insolvency matters
ga: 663/2014 (pdf) athrú chun dáta ar na hIarscríbhinní leis an Rialachán Imeachtaí Dócmhainneachta (CE) Uimh. 1346/2000 (pdf), arb é is aidhm dó foirmiúlachtaí a rialaíonn aithint chómhalartach agus forfheidhmiú cómhalartach na mbreithiúnas i gcúrsaí dócmhainneachta trasteorann a shimpliú

source: The updated Insolvency Regulation designates the DRN, DSA and PIA as insolvency proceedings that can benefit from cross-border recognition
ga: Ainmníonn an Rialachán Dócmhainneachta athraithe chun dáta DRN, DSA agus SDP mar imeachtaí dócmhainneachta a fhéadann leas a bhaint as aitheantas trasteorann

source: This means that a debtor availing of a DRN, DSA or PIA will gain the same protection against creditors in most other EU countries that they receive in Ireland, subject to and in accordance with the Insolvency Regulation
ga: Fágann sé sin go mbeidh an chosaint chéanna ar chreidiúnaithe i bhformhór na dtíortha eile den AE is atá aige/aici in Éirinn ag féichiúnaí atá ag baint leas as DRN, DSA nó SDP, faoi réir agus de réir an Rialacháin Dócmhainneachta

source: Read more in this press release
ga: Léigh tuilleadh sa phreaseisiúint seo

source: The Debt Relief Notice (DRN) process provides debt relief for people who have virtually no disposable income or assets and no prospect of being able to pay off the debt in the next 3 years
ga: Cuireann an Fógra um Fhaoiseamh Fiachais (DRN) faoiseamh fiachais ar fáil do dhaoine atá ar bheagán ioncam nó sócmhainní indiúscartha agus nach dócha go mbeidh siad in ann a bhfiachas a íoc sna 3 bliana amach romhainn

source: If a DRN is issued for you, it will allow for the write-off of your qualifying debt up to €35,000 (formerly €20,000) subject to a 3-year supervision period
ga: Má eisítear DRN duit, ceadóidh sé díscríobh do chuid fiachais cháilithigh a mhéid le €20,000, faoi réir tréimhse mhaoirseachta 3 bliana

source: During this period your creditors will not be able to pursue you for payment, but if your circumstances improve during the 3 years, you may have to pay part of your debts accordingly
ga: Le linn na tréimhse seo, ní bheidh do chreidiúnaithe in ann dul sa tóir ort chun íocaíocht a fháil, ach má thagann feabhas ar do chúinsí le linn na 3 bliana, b’fhéidir go mbeidh ort cuid de d’fhiachas a íoc dá réir

source: At the end of the 3 years, all of the debts covered by the DRN will be written off, even if you have not managed to pay anything off them
ga: Ag deireadh na 3 bliana, díscríobhfar an fiachas go léir a chumhdaíonn an DRN, fiú murar éirigh leat aon rud a íoc orthu

source: How do you get a DRN?
ga: Conas a fhaigheann tú DRN?

source: Your application must be made through an Approved Intermediary (AI) – see How to apply below
ga: Ní mór duit d'iarratas a dhéanamh trí Idirghabhálaí Faofa (AI) - féach Conas iarratas a dhéanamh thíos

source: This is a person or class of persons authorised by the ISI to support a debtor to make an application for a Debt Relief Notice
ga: Is é atá anseo ná duine nó aicme daoine atá údaraithe ag an ISI chun tacú le féichiúnaí iarratas ar Fhógra um Fhaoiseamh Fiachais a dhéanamh

source: Read more in our document on Debt Relief Notices (DRNs) and on the ISI's website
ga: Is féidir leat níos mó a léamh inár gcáipéis ar Fhógraí um Fhaoiseamh Fiachais (DRNanna) agus i láithreán gréasáin Sheirbhís Dócmhainneachta na hÉireann

source: A Debt Settlement Arrangement (DSA) provides for the agreed settlement of unsecured debt with one or more creditors over a period of 5 years, with a possible agreed extension to 6 years
ga: Déanann Socrú Réitigh Fiachais (DSA) soláthar do réiteach comhaontaithe fiachais gan urrús le creidiúnaí amháin nó níos mó thar thréimhse 5 bliana, le síneadh féideartha comhaontaithe a fhad le 6 bliana

source: You may apply for a DSA if the level of your income, assets and debts would make you ineligible for a Debt Relief Notice
ga: D’fhéadfá bheith in ann iarratas a dhéanamh ar DSA dá mbeifeá neamh-incháilithe chun Fógra um Fhaoiseamh Fiachais a fháil de dheasca do leibhéil ioncam, sócmhainní agus fiachais

source: You must be able to make some repayments to your creditors in return for a discount of your debts
ga: Níor mhór go mbeifeá in ann roinnt aisíocaíochtaí a dhéanamh le do chreidiúnaithe mar chúiteamh ar lascaine ar d'fhiachas

source: The DSA is a voluntary arrangement and it will have to get the support of creditors representing at least 65% of your total debt
ga: Socrú deonach atá sa DSA agus beidh ort tacaíocht chreidiúnaithe a fháil a léiríonn ar a laghad 65% de d’fhiachas iomlán

source: You must process your application through a Personal Insolvency Practitioner (PIP)
ga: Ní mór duit d’iarratas a phróiseáil trí Chleachtóir um Dhócmhainneacht Phearsanta (PIP)

source: This is a professional who is approved and registered by the Insolvency Service of Ireland to operate DSAs and Personal Insolvency Arrangements – see How to apply below
ga: Seo gairmí a bhain údarú agus clárú amach ó Sheirbhís Dócmhainneachta na hÉireann chun DSAanna agus Socruithe um Dhócmhainneacht Phearsanta a fheidhmiú - féach Conas iarratas a dhéanamh thíos

source: When the agreed period ends, and if your DSA has operated successfully, you will be discharged from the debts that it covered
ga: Nuair a thiocfaidh deireadh leis an tréimhse lenar comhaontaíodh, agus má d’fheidhmigh do DSA go rathúil, díscaoilfear thú ón bhfiachas a chumhdaigh sé

source: Read more in our document on Debt Settlement Arrangements (DSAs) and on the ISI's website
ga: Féadfaidh tú tuilleadh a léamh inár gcáipéis ar Shocraithe Réitigh Fiachais agus ar láithreán gréasáin Sheirbhís Dócmhainneachta na hÉireann

source: A Personal Insolvency Arrangement (PIA) provides for the agreed settlement of secured debt up to a limit of €3 million (although this cap may be increased with the consent of all secured creditors) and an unlimited amount of unsecured debt
ga: Déanann Socrú um Dhócmhainneacht Phearsanta (PIA) soláthar do réiteach comhaontaithe fiachais a mhéid le huasteorainn €3 milliún (cé gur féidir an uasteorainn seo a mhéadú le toiliú gach creidiúnaí faoi urrús a fháil) agus a mhéid le suim gan teorainn d’fhiachas gan urrús

source: A PIA will run over a period of 6 years, with a possible agreed extension to 7 years
ga: Beidh PIA ar bun ar feadh tréimhse 6 bliana, le síneadh féideartha comhaontaithe a fhad le 7 mbliana

source: The PIA works like a Debt Settlement Arrangement in the following ways:
ga: Oibríonn an PIA ar nós Socrú Réitigh Fiachais ar na bealaí a leanas:

source: • You must apply through a Personal Insolvency Practitioner (PIP) – see How to apply below
ga: • Ní mór duit d’iarratas a dhéanamh trí Chleachtóir um Dhócmhainneacht Phearsanta (PIP) - féach Conas iarratas a dhéanamh thíos

source: • You must be able to make some repayments to your creditors in return for a discount of your debts
ga: • Níor mhór go mbeifeá in ann roinnt aisíocaíochtaí a dhéanamh le do chreidiúnaithe mar chúiteamh ar lascaine ar d'fhiachas

source: • It is a voluntary arrangement and must get the support of creditors – both secured and unsecured – representing at least 65% of your total debt
ga: • Socrú deonach atá ann agus beidh ort tacaíocht chreidiúnaithe a fháil (creidiúnaithe faoi urrús agus gan urrús) a léiríonn ar a laghad 65% de d’fhiachas iomlán

source: In addition, over 50% of your secured creditors and 50% of unsecured creditors must vote in favour
ga: Anuas air sin, ní mór go gcaithfidh breis agus 50% de do chuid creidiúnaithe faoi urrús agus 50% de do chuid creidiúnaithe gan urrús vóta ina fhabhar

source: However, the Personal Insolvency (Amendment) Act 2015 now provides for court review where a mortgage lender rejects the borrower’s personal insolvency proposal. A new aid and advice scheme for people in serious mortgage arrears allows for free legal representation for eligible borrowers in seeking such a review
ga: Nuair a thiocfaidh deireadh leis an tréimhse lenar comhaontaíodh, agus má d’fheidhmigh do PIA go rathúil, díscaoilfear thú ón bhfiachas a chumhdaigh sé ach ní dhíscaoilfear an fiachas faoi urrús ach amháin an méid a shonraítear sa PIA

source: When the agreed period ends, and if your PIA has operated successfully, you will be discharged from the unsecured debts that it covered but the secured debt will only be discharged to the extent specified in the PIA
ga: Is féidir leat níos mó a léamh inár gcáipéis ar Shocruithe um Dhócmhainneacht Phearsanta (PIAanna) agus ar láithreán gréasáin Sheirbhís Dócmhainneachta na hÉireann

source: │Arrangement │Type of debt covered │Value │Duration │Apply through │
ga: │Socrú │Saghas an fhiachais a chumhdaítear │Luach │Fad │Cé air a dhéanfaidh mé iarratas?

source: │Bankruptcy previously │Unsecured and secured │At least €1,900 (1 creditor) or €1,300 (combined creditors) │12 years │High Court (voluntary declaration or else creditors could petition) │
ga: │Féimheacht roimhe seo │Faoi urrús agus gan urrús │Ar a laghad €1,900 (creidiúnaí anhain) nó €1,300 (comhchreidiúnaithe) │12 bhliain │An Ard-Chúirt (dearbhú deonach nó d'fhéadfadh creidiúnaithe achainí a dhéanamh) │

source: │Debt Relief Notice (DRN) │Unsecured (and secured in certain cases) │Up to €35,000 (formerly €20,000) │3 years │Approved Intermediary (AI) │
ga: │Fógraí um Fhaoiseamh Fiachais (DRN) │Gan urrús (agus faoi urrús i gcásanna áirithe) │A mhéid le €20,000 │3 bliana │Idirghabhálaí Faofa (AI) │

source: │Debt Settlement Arrangement (DSA) │Unsecured │No limit │5 years (+1)│Personal Insolvency Practitioner (PIP) │
ga: │Socrú Réitigh Fiachais (DSA) │Gan urrús │Teorainn ar bith │5 bliana (+1)│Cleachtóir um Dhócmhainneacht Phearsanta (PIP) │

source: │ │ │No limit on unsecured │ │ │
ga: │ │ │Teorainn ar bith ar fhiachas gan urrús │ │ │

source: │Personal Insolvency Arrangement (PIA) │Unsecured and secured │ │6 years (+1)│Personal Insolvency Practitioner (PIP) │
ga: │Socrú um Dhócmhainneacht Phearsanta (PIA) │Faoi urrús agus gan urrús │ │6 bliana (+1)│Cleachtóir um Dhócmhainneacht Phearsanta (PIP) │

source: │ │ │Up to €3m secured (though cap can increase if agreed) │ │ │
ga: │ │ │A mhéid le €3 milliún ar fhiachas faoi urrús (cé gur féidir an uasteorainn a mhéadú má chomhaontaítear) │ │ │

source: │Bankruptcy from 3 December 2013 │Unsecured and secured │Over €20,000 │3 years │High Court (voluntary declaration or else creditors can petition) │
ga: │Féimheacht ó 3 Nollaig 2013 │Faoi urrús agus gan urrús │€20,000 │3 bliana │An Ard-Chúirt (dearbhú deonach nó d'fhéadfadh creidiúnaithe achainí a dhéanamh) │

source: Note: You cannot apply on your own for a DRN, DSA or PIA
ga: Nóta: Ní féidir leat iarratas a dhéanamh leat féin ar DRN, DSA nó PIA

source: You must apply through an Approved Intermediary (for a DRN) or a Personal Insolvency Practitioner (for a DSA or PIA)
ga: Ní mór duit d’iarratas a dhéanamh trí Idirghabhálaí Faofa (ar DRN) nó trí Chleachtóir um Dhócmhainneacht Phearsanta (le haghaidh DSA nó PIA)

source: Insolvency Service of Ireland
ga: Seirbhís Dócmhainneachta na hÉireann

source: The Insolvency Service of Ireland (ISI) is responsible for all matters concerning personal insolvency
ga: Tá Seirbhís Dócmhainneachta na hÉireann (SDÉ) freagrach as gach ábhar lena mbaineann dócmhainneacht phearsanta

source: • Certifying applications for Debt Relief Notices
ga: • Iarratais a dheimhniú le haghaidh Fógraí um Fhaoiseamh Fiachais

source: • Certifying applications for Debt Settlement Arrangement and Personal Insolvency Arrangements
ga: • Iarratais a dheimhniú le haghaidh Socrú Réitigh Fiachais agus Socruithe um Dhócmhainneacht Phearsanta

source: • Developing guidelines for insolvency procedures
ga: • Treoirlínte a fhorbairt do nósanna imeachta dócmhainneachta

source: • Authorising Approved Intermediaries (AIs)
ga: • Idirghabhálaithe Faofa (AIanna) a údarú

source: • Authorising and regulating Personal Insolvency Practitioners (PIPs)
ga: • Cleachtóirí um Dhócmhainneacht Phearsanta (PIPanna) a údarú agus a rialú

source: • Monitoring the operation of the arrangements
ga: • Monatóireacht a dhéanamh ar fheidhmiú na socruithe

source: The Office of the Official Assignee in Bankruptcy is based in the ISI
ga: Tá Oifig an tSannaí Oifigiúil i bhFéimheacht aistrithe go dtí an tSeirbhís Dócmhainneachta anois

source: This office administers the estate of a bankrupt person after the High Court has made a Bankruptcy Order
ga: Riarann an oifig seo eastát an fhéimhigh tar éis don Ardchúirt Ordú Féimheachta a dhéanamh

source: For a Debt Relief Notice, your application must be made through an Approved Intermediary (AI)
ga: I gcás Fógra um Fhaoiseamh Fiachais, ní mór d’iarratas a dhéanamh trí Idirghabhálaí Faofa (AI)

source: You can choose an AI from the Register of Approved Intermediaries that is published by the ISI
ga: Is féidir AI a roghnú ó Chlár na nIdirghabhálaithe Faofa a fhoilsíonn an SDÉ é

source: All Money Advice and Budgeting Services (MABS) companies are authorised as Approved Intermediaries and AIs are available in over 65 MABS locations across the State
ga: Go dtí seo, tá 40 Seirbhís Bhuiséadta agus Chomhairle Airgid (MABS) údaraithe mar AIanna

source: The MABS Helpline provides an initial checking service to check if you satisfy the eligibility criteria for a DRN
ga: Cuireann líne chabhrach MABS seirbhís seiceála ar fáil chun a sheiceáil an líonann tú na critéir cháilitheachta le haghaidh DRN nó nach gcomhlíonann
